Revit 2016 API
KeyBasedTreeEntries.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator<KeyBasedTreeEntry> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of KeyBasedTreeEntry)
Visual C++
public:
virtual IEnumerator<KeyBasedTreeEntry^>^ GetEnumerator()
Return Value
An IEnumerator( Autodesk::Revit::DB::KeyBasedTreeEntry^) object that can be used to iterate through KeyBasedTreeEntry objects in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace